In [1]:
import pandas as pd

# Groupby

In [2]:
df_president_name = pd.DataFrame({'first': ['George', 'Bill', 'Ronald', 'Jimmy', 'George'],
                                 "last": ['Bush', 'Clinton', 'Regan', "Carter", 'Washington']})

In [3]:
print (df_president_name)

    first        last
0  George        Bush
1    Bill     Clinton
2  Ronald       Regan
3   Jimmy      Carter
4  George  Washington

In [4]:
grouped = df_president_name.groupby('first')

In [5]:
grouped

In [6]:
grp_data = grouped.get_group('Bill')
grp_data

  first     last
1  Bill  Clinton

# Sort

In [7]:
df_president_name.sort_values('first')

    first        last
1    Bill     Clinton
0  George        Bush
4  George  Washington
3   Jimmy      Carter
2  Ronald       Regan

In [8]:
df_president_name.sort_values('first', ascending = False)

    first        last
2  Ronald       Regan
3   Jimmy      Carter
0  George        Bush
4  George  Washington
1    Bill     Clinton

# standardize - we standardize to reduce the range of data

In [9]:
df_test_scores = pd.DataFrame({'Score1': [95,84,73,88,82,61], 'Score2': [74,85,82,73,77,79]}, 
                              index = ['Jack','Lewis','Patrick','Rich','Kelly','Paula'])

In [10]:
def standardize_test(test):
    return((test-test.mean())/test.std())

In [11]:
print (df_test_scores)

         Score1  Score2
Jack         95      74
Lewis        84      85
Patrick      73      82
Rich         88      73
Kelly        82      77
Paula        61      79

In [12]:
standardize_test(df_test_scores)

           Score1    Score2
Jack     1.210437 -0.935276
Lewis    0.292174  1.438886
Patrick -0.626088  0.791387
Rich     0.626088 -1.151109
Kelly    0.125218 -0.287777
Paula   -1.627829  0.143889

In [13]:
standardize_test(df_test_scores['Score1'])

Jack       1.210437
Lewis      0.292174
Patrick   -0.626088
Rich       0.626088
Kelly      0.125218
Paula     -1.627829
Name: Score1, dtype: float64

# File Read and Write Support

In [14]:
data = pd.read_csv('winequality.csv')
print (data.head())

      ID  fixed acidity  volatile acidity  citric acid  residual sugar  \
0  W0001            7.0              0.27         0.36            20.7
1  W0002            6.3              0.30         0.34             1.6
2  W0003            8.1              0.28         0.40             6.9
3  W0004            7.2              0.23         0.32             8.5
4  W0005            7.2              0.23         0.32             8.5

   chlorides  free sulfur dioxide  total sulfur dioxide  density    pH  \
0      0.045                 45.0                 170.0   1.0010  3.00
1      0.049                 14.0                 132.0   0.9940  3.30
2      0.050                 30.0                  97.0   0.9951  3.26
3      0.058                 47.0                 186.0   0.9956  3.19
4      0.058                 47.0                 186.0   0.9956  3.19

   sulphates  alcohol  quality
0       0.45      8.8      2.0
1        NaN      9.5      2.0
2        NaN     10.1      2.0
3       0.40      9.9      2.0
4       0.40      9.9      2.0

In [15]:
data = pd.read_excel('winequality.xlsx')
data.head()

,ID,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
0,W0001,7.0,0.27,0.36,20.7,0.045,45.0,170.0,1.0010,3.00,0.45,8.8,2.0
1,W0002,6.3,0.30,0.34,1.6,0.049,14.0,132.0,0.9940,3.30,NaN,9.5,2.0
2,W0003,8.1,0.28,0.40,6.9,0.050,30.0,97.0,0.9951,3.26,NaN,10.1,2.0
3,W0004,7.2,0.23,0.32,8.5,0.058,47.0,186.0,0.9956,3.19,0.40,9.9,2.0
4,W0005,7.2,0.23,0.32,8.5,0.058,47.0,186.0,0.9956,3.19,0.40,9.9,2.0

In [16]:
data = pd.read_csv('winequality.txt')
data.head()

,ID,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
0,W0001,7.0,0.27,0.36,20.7,0.045,45.0,170.0,1.0010,3.00,0.45,8.8,2.0
1,W0002,6.3,0.30,0.34,1.6,0.049,14.0,132.0,0.9940,3.30,NaN,9.5,2.0
2,W0003,8.1,0.28,0.40,6.9,0.050,30.0,97.0,0.9951,3.26,NaN,10.1,2.0
3,W0004,7.2,0.23,0.32,8.5,0.058,47.0,186.0,0.9956,3.19,0.40,9.9,2.0
4,W0005,7.2,0.23,0.32,8.5,0.058,47.0,186.0,0.9956,3.19,0.40,9.9,2.0

In [17]:
data = pd.read_csv('hills.txt', sep = '\t')

In [18]:
data.head()

          Race        Distance  Climb    Time
0  Greenmantle             2.5    650  16.083
1     Carnethy             6.0   2500  48.350
2  CraigDunain             6.0    900  33.650
3       BenRha             7.5    800  45.600
4    BenLomond             8.0   3070  62.267

In [19]:
data = pd.read_csv(r'C:\Users\DELL 1\Documents\Python\Vodafone\Libraries\hills.txt', sep = '\t')

In [20]:
data.head()

          Race        Distance  Climb    Time
0  Greenmantle             2.5    650  16.083
1     Carnethy             6.0   2500  48.350
2  CraigDunain             6.0    900  33.650
3       BenRha             7.5    800  45.600
4    BenLomond             8.0   3070  62.267

In [21]:
data = pd.read_csv('C:/Users/DELL 1/Documents/Python/Vodafone/Libraries/hills.txt', 
                   sep = '\t')

In [22]:
data.head()

          Race        Distance  Climb    Time
0  Greenmantle             2.5    650  16.083
1     Carnethy             6.0   2500  48.350
2  CraigDunain             6.0    900  33.650
3       BenRha             7.5    800  45.600
4    BenLomond             8.0   3070  62.267

In [23]:
data = pd.read_csv('C:\\Users\\DELL 1\\Documents\\Python\\Vodafone\\Libraries\\hills.txt', 
                   sep = '\t')

In [24]:
data.head()

          Race        Distance  Climb    Time
0  Greenmantle             2.5    650  16.083
1     Carnethy             6.0   2500  48.350
2  CraigDunain             6.0    900  33.650
3       BenRha             7.5    800  45.600
4    BenLomond             8.0   3070  62.267

In [25]:
data = pd.read_csv('winequality.txt')
print(data.head())

      ID  fixed acidity  volatile acidity  citric acid  residual sugar  \
0  W0001            7.0              0.27         0.36            20.7
1  W0002            6.3              0.30         0.34             1.6
2  W0003            8.1              0.28         0.40             6.9
3  W0004            7.2              0.23         0.32             8.5
4  W0005            7.2              0.23         0.32             8.5

   chlorides  free sulfur dioxide  total sulfur dioxide  density    pH  \
0      0.045                 45.0                 170.0   1.0010  3.00
1      0.049                 14.0                 132.0   0.9940  3.30
2      0.050                 30.0                  97.0   0.9951  3.26
3      0.058                 47.0                 186.0   0.9956  3.19
4      0.058                 47.0                 186.0   0.9956  3.19

   sulphates  alcohol  quality
0       0.45      8.8      2.0
1        NaN      9.5      2.0
2        NaN     10.1      2.0
3       0.40      9.9      2.0
4       0.40      9.9      2.0

In [26]:
data.to_csv('winequality_clean3.csv')